# parameters
nc: 4  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv,    [48 ,  3, 2]],  # 0-P1/2
   [-1, 1, SGBlock, [96 ,  2, 2]],  # 1-P2/4
   [-1, 1, SGBlock, [144 , 1, 6]],  # 2

   [-1, 1, SGBlock, [192 , 1, 6]],
   [-1, 1, SGBlock, [192 , 1, 6]],
   [-1, 1, SGBlock, [192 , 2, 6]],  # 5-P3/8

   [-1, 1, SGBlock, [288 , 1, 6]],
   [-1, 1, SGBlock, [288 , 1, 6]],
   [-1, 1, SGBlock, [288 , 2, 6]],  # 8-P4/16

   [-1, 1, SGBlock, [384 , 1, 6]],
   [-1, 1, SGBlock, [384 , 1, 6]],
   [-1, 1, SGBlock, [384 , 1, 6]],
   [-1, 1, SGBlock, [384 , 1, 6]],  # 12

   [-1, 1, SGBlock, [576 , 1, 6]],
   [-1, 1, SGBlock, [576 , 1, 6]],
   [-1, 1, SGBlock, [576 , 1, 6]],  # 15
   [-1, 1, SGBlock, [576 , 2, 6]],  # 16-P5/32

   [-1, 1, SGBlock, [960 , 1, 6]],
   [-1, 1, SGBlock, [960 , 1, 6]],
   [-1, 1, SGBlock, [960 , 1, 6]],  # 19

   [-1, 1, SGBlock, [1280, 1, 6]],  # 20
   [-1, 1, SPPF, [1024, 5]],        # 21
  ]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]], # 22

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [15, 1, Conv, [256, 1, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 34----------------------------

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [7, 1, Conv, [128, 1, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]], # 46

   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3, 34], 1, Concat, [1]],

   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 59

   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3, 22], 1, Concat, [1]],

   [-1, 1, Conv, [512, 1, 1]],
   [-2, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]], # 72

   [46, 1, RepConv, [256, 3, 1]],
   [59, 1, RepConv, [512, 3, 1]],
   [72, 1, RepConv, [1024, 3, 1]],

   [[73,74,75], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
